run_test_OpenFOAM_programming_command/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    upperPatch
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    ground
    {
        type            calculated;
        value           nonuniform List<vector> 
8153
(
(-0.000560372 6.65169e-05 -4.40759e-06)
(-0.000523326 8.55583e-06 -2.79653e-07)
(-0.00104836 -4.43002e-05 2.20593e-08)
(-0.00107049 -4.038e-05 -3.59787e-06)
(-0.00104834 -4.42986e-05 -2.21511e-08)
(-0.00165784 5.73349e-05 -4.93584e-08)
(-0.00165787 5.73359e-05 4.9359e-08)
(-0.000525131 1.09851e-05 8.00572e-08)
...
)
;
    }
}


// ************************************************************************* //
