run_test_OpenFOAM_programming_command/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     shear_stress;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          2000;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii; //binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    //#include "streamlines"
    //#include "cuttingPlane"
    //#include "forceCoeffs"
	
	//#include "wallShearStress"
}


// ************************************************************************* //
